In [46]:
import pandas as pd
import numpy as np

loading dataset in pandas

In [47]:
df = pd.read_csv(r"C:\Users\lenovo\Downloads\Titanic-Dataset.csv")

In [48]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [49]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [50]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [51]:
df["PassengerId"]

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: PassengerId, Length: 891, dtype: int64

In [52]:
df[["PassengerId","Name","Sex","Survived"]]

,PassengerId,Name,Sex,Survived
0,1,"Braund, Mr. Owen Harris",male,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1
2,3,"Heikkinen, Miss. Laina",female,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1
4,5,"Allen, Mr. William Henry",male,0
...,...,...,...,...
886,887,"Montvila, Rev. Juozas",male,0
887,888,"Graham, Miss. Margaret Edith",female,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,0
889,890,"Behr, Mr. Karl Howell",male,1
890,891,"Dooley, Mr. Patrick",male,0

In [53]:
df[["PassengerId","Name","Sex","Survived"]].head(6)

,PassengerId,Name,Sex,Survived
0,1,"Braund, Mr. Owen Harris",male,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1
2,3,"Heikkinen, Miss. Laina",female,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1
4,5,"Allen, Mr. William Henry",male,0
5,6,"Moran, Mr. James",male,0

In [54]:
df[["Name","Sex","Age"]].head()

                                                Name     Sex   Age
0                            Braund, Mr. Owen Harris    male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                             Heikkinen, Miss. Laina  female  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                           Allen, Mr. William Henry    male  35.0

In [55]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## slicing im pandas using loc

In [56]:
df.loc[4:10, "Name":"Parch"]

,Name,Sex,Age,SibSp,Parch
4,"Allen, Mr. William Henry",male,35.0,0,0
5,"Moran, Mr. James",male,NaN,0,0
6,"McCarthy, Mr. Timothy J",male,54.0,0,0
7,"Palsson, Master. Gosta Leonard",male,2.0,3,1
8,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2
9,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0
10,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1

In [57]:
df.loc[10:20, "Ticket":"Embarked"]

       Ticket     Fare Cabin Embarked
10    PP 9549  16.7000    G6        S
11     113783  26.5500  C103        S
12  A/5. 2151   8.0500   NaN        S
13     347082  31.2750   NaN        S
14     350406   7.8542   NaN        S
15     248706  16.0000   NaN        S
16     382652  29.1250   NaN        Q
17     244373  13.0000   NaN        S
18     345763  18.0000   NaN        S
19       2649   7.2250   NaN        C
20     239865  26.0000   NaN        S

In [58]:
df.iloc[10:20,2:8]

,Pclass,Name,Sex,Age,SibSp,Parch
10,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1
11,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0
12,3,"Saundercock, Mr. William Henry",male,20.0,0,0
13,3,"Andersson, Mr. Anders Johan",male,39.0,1,5
14,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0
15,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0
16,3,"Rice, Master. Eugene",male,2.0,4,1
17,2,"Williams, Mr. Charles Eugene",male,NaN,0,0
18,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0
19,3,"Masselmani, Mrs. Fatima",female,NaN,0,0

In [59]:
df[["Name", "Parch"]]

                                                  Name  Parch
0                              Braund, Mr. Owen Harris      0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...      0
2                               Heikkinen, Miss. Laina      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)      0
4                             Allen, Mr. William Henry      0
..                                                 ...    ...
886                              Montvila, Rev. Juozas      0
887                       Graham, Miss. Margaret Edith      0
888           Johnston, Miss. Catherine Helen "Carrie"      2
889                              Behr, Mr. Karl Howell      0
890                                Dooley, Mr. Patrick      0

[891 rows x 2 columns]

In [60]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [61]:
df.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
857,858,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.550,E17,S
528,529,0,3,"Salonen, Mr. Johan Werner",male,39.0,0,0,3101296,7.925,NaN,S
562,563,0,2,"Norman, Mr. Robert Douglas",male,28.0,0,0,218629,13.500,NaN,S
706,707,1,2,"Kelly, Mrs. Florence ""Fannie""",female,45.0,0,0,223596,13.500,NaN,S
434,435,0,1,"Silvey, Mr. William Baird",male,50.0,1,0,13507,55.900,E44,S

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

checking missing values

In [63]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [64]:
df["Embarked"].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [65]:
age_mean = df["Age"].mean()

In [66]:
age_mean = np.round(age_mean, 2)
age_mean

np.float64(29.7)

In [67]:
embarked_mode = df["Embarked"].mode()[0]

In [68]:
embarked_mode

'S'

In [69]:
df["Age"] = df["Age"].fillna(age_mean)
df["Embarked"] = df["Embarked"].fillna(embarked_mode)

In [70]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [71]:
removing_columns = ["PassengerId","Name","Ticket"]

In [72]:
df = df.drop(columns=removing_columns)

In [73]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0         0       3    male  22.0      1      0   7.2500   NaN        S
1         1       1  female  38.0      1      0  71.2833   C85        C
2         1       3  female  26.0      0      0   7.9250   NaN        S
3         1       1  female  35.0      1      0  53.1000  C123        S
4         0       3    male  35.0      0      0   8.0500   NaN        S

In [74]:
df["Family_size"] = df["SibSp"] + df["Parch"] +1

In [75]:
df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Family_size
0,0,3,male,22.0,1,0,7.2500,NaN,S,2
1,1,1,female,38.0,1,0,71.2833,C85,C,2
2,1,3,female,26.0,0,0,7.9250,NaN,S,1
3,1,1,female,35.0,1,0,53.1000,C123,S,2
4,0,3,male,35.0,0,0,8.0500,NaN,S,1

In [76]:
df = df.drop(columns=["SibSp","Parch"])

In [77]:
df.head()

   Survived  Pclass     Sex   Age     Fare Cabin Embarked  Family_size
0         0       3    male  22.0   7.2500   NaN        S            2
1         1       1  female  38.0  71.2833   C85        C            2
2         1       3  female  26.0   7.9250   NaN        S            1
3         1       1  female  35.0  53.1000  C123        S            2
4         0       3    male  35.0   8.0500   NaN        S            1

In [78]:
#df = df.drop(columns=["Cabin"])

In [79]:
df.head(5)

   Survived  Pclass     Sex   Age     Fare Cabin Embarked  Family_size
0         0       3    male  22.0   7.2500   NaN        S            2
1         1       1  female  38.0  71.2833   C85        C            2
2         1       3  female  26.0   7.9250   NaN        S            1
3         1       1  female  35.0  53.1000  C123        S            2
4         0       3    male  35.0   8.0500   NaN        S            1

### converting categorical data into numerical

In [80]:
df["Sex"] = df["Sex"].map({"male": 1, "female":0})

In [81]:
df.head()

   Survived  Pclass  Sex   Age     Fare Cabin Embarked  Family_size
0         0       3    1  22.0   7.2500   NaN        S            2
1         1       1    0  38.0  71.2833   C85        C            2
2         1       3    0  26.0   7.9250   NaN        S            1
3         1       1    0  35.0  53.1000  C123        S            2
4         0       3    1  35.0   8.0500   NaN        S            1

In [82]:
df1 = df.copy()

In [83]:
df1.head()

   Survived  Pclass  Sex   Age     Fare Cabin Embarked  Family_size
0         0       3    1  22.0   7.2500   NaN        S            2
1         1       1    0  38.0  71.2833   C85        C            2
2         1       3    0  26.0   7.9250   NaN        S            1
3         1       1    0  35.0  53.1000  C123        S            2
4         0       3    1  35.0   8.0500   NaN        S            1

In [84]:
df1 = pd.get_dummies(df1, columns=["Embarked"],dtype=int)

In [85]:
df1.head()

,Survived,Pclass,Sex,Age,Fare,Cabin,Family_size,Embarked_C,Embarked_Q,Embarked_S
0,0,3,1,22.0,7.2500,NaN,2,0,0,1
1,1,1,0,38.0,71.2833,C85,2,1,0,0
2,1,3,0,26.0,7.9250,NaN,1,0,0,1
3,1,1,0,35.0,53.1000,C123,2,0,0,1
4,0,3,1,35.0,8.0500,NaN,1,0,0,1

In [86]:
df1 = pd.get_dummies(df1, columns=["Embarked_C"],dtype= int, drop_first=True)

In [87]:
df1.head()

,Survived,Pclass,Sex,Age,Fare,Cabin,Family_size,Embarked_Q,Embarked_S,Embarked_C_1
0,0,3,1,22.0,7.2500,NaN,2,0,1,0
1,1,1,0,38.0,71.2833,C85,2,0,0,1
2,1,3,0,26.0,7.9250,NaN,1,0,1,0
3,1,1,0,35.0,53.1000,C123,2,0,1,0
4,0,3,1,35.0,8.0500,NaN,1,0,1,0

In [88]:
def fare_category(fare):
    if fare < 15:
        return "Low"
    elif fare < 40:
        return "Medium"
    else:
        return "High"

In [89]:
df1["fare_category"] = df1["Fare"].apply(fare_category)

In [90]:
df1.head()

,Survived,Pclass,Sex,Age,Fare,Cabin,Family_size,Embarked_Q,Embarked_S,Embarked_C_1,fare_category
0,0,3,1,22.0,7.2500,NaN,2,0,1,0,Low
1,1,1,0,38.0,71.2833,C85,2,0,0,1,High
2,1,3,0,26.0,7.9250,NaN,1,0,1,0,Low
3,1,1,0,35.0,53.1000,C123,2,0,1,0,High
4,0,3,1,35.0,8.0500,NaN,1,0,1,0,Low

### Remove the fare category column

In [92]:
df1 = df1.drop(columns=["Fare"])

In [93]:
df1.head()

,Survived,Pclass,Sex,Age,Cabin,Family_size,Embarked_Q,Embarked_S,Embarked_C_1,fare_category
0,0,3,1,22.0,NaN,2,0,1,0,Low
1,1,1,0,38.0,C85,2,0,0,1,High
2,1,3,0,26.0,NaN,1,0,1,0,Low
3,1,1,0,35.0,C123,2,0,1,0,High
4,0,3,1,35.0,NaN,1,0,1,0,Low

In [95]:
df1["Cabin"].values

array([nan, 'C85', nan, 'C123', nan, nan, 'E46', nan, nan, nan, 'G6',
       'C103', nan, nan, nan, nan, nan, nan, nan, nan, nan, 'D56', nan,
       'A6', nan, nan, nan, 'C23 C25 C27', nan, nan, nan, 'B78', nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, 'D33', nan, 'B30', 'C52', nan, nan, nan,
       nan, nan, 'B28', 'C83', nan, nan, nan, 'F33', nan, nan, nan, nan,
       nan, nan, nan, nan, 'F G73', nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, 'C23 C25 C27', nan, nan, nan, 'E31', nan,
       nan, nan, 'A5', 'D10 D12', nan, nan, nan, nan, 'D26', nan, nan,
       nan, nan, nan, nan, nan, 'C110', nan, nan, nan, nan, nan, nan, nan,
       'B58 B60', nan, nan, nan, nan, 'E101', 'D26', nan, nan, nan,
       'F E69', nan, nan, nan, nan, nan, nan, nan, 'D47', 'C123', nan,
       'B86', nan, nan, nan, nan, nan, nan, nan, nan, 'F2', nan, nan,
       'C2', nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, 'E33', nan, nan, nan, 'B19', nan, nan, nan, 'A7', nan,
       nan, 'C49', nan, nan, nan, nan, nan, 'F4', nan, 'A32', nan, nan,
       nan, nan, nan, nan, nan, 'F2', 'B4', 'B80', nan, nan, nan, nan,
       nan, nan, nan, nan, nan, 'G6', nan, nan, nan, 'A31', nan, nan, nan,
       nan, nan, 'D36', nan, nan, 'D15', nan, nan, nan, nan, nan, 'C93',
       nan, nan, nan, nan, nan, 'C83', nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, 'C78', nan, nan, 'D35', nan,
       nan, 'G6', 'C87', nan, nan, nan, nan, 'B77', nan, nan, nan, nan,
       'E67', 'B94', nan, nan, nan, nan, 'C125', 'C99', nan, nan, nan,
       'C118', nan, 'D7', nan, nan, nan, nan, nan, nan, nan, nan, 'A19',
       nan, nan, nan, nan, nan, nan, 'B49', 'D', nan, nan, nan, nan,
       'C22 C26', 'C106', 'B58 B60', nan, nan, nan, 'E101', nan,
       'C22 C26', nan, 'C65', nan, 'E36', 'C54', 'B57 B59 B63 B66', nan,
       nan, nan, nan, nan, nan, 'C7', 'E34', nan, nan, nan, nan, nan,
       'C32', nan, 'D', nan, 'B18', nan, 'C124', 'C91', nan, nan, nan,
       'C2', 'E40', nan, 'T', 'F2', 'C23 C25 C27', nan, nan, nan, 'F33',
       nan, nan, nan, nan, nan, 'C128', nan, nan, nan, nan, 'E33', nan,
       nan, nan, nan, nan, nan, nan, nan, nan, 'D37', nan, nan, 'B35',
       'E50', nan, nan, nan, nan, nan, nan, 'C82', nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, 'B96 B98', nan, nan, 'D36',
       'G6', nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, 'C78', nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, 'E10', 'C52', nan,
       nan, nan, 'E44', 'B96 B98', nan, nan, 'C23 C25 C27', nan, nan, nan,
       nan, nan, nan, 'A34', nan, nan, nan, 'C104', nan, nan, 'C111',
       'C92', nan, nan, 'E38', 'D21', nan, nan, 'E12', nan, 'E63', nan,
       nan, nan, nan, nan, nan, nan, nan, nan, nan, 'D', nan, 'A14', nan,
       nan, nan, nan, nan, nan, nan, nan, 'B49', nan, 'C93', 'B37', nan,
       nan, nan, nan, 'C30', nan, nan, nan, 'D20', nan, 'C22 C26', nan,
       nan, nan, nan, nan, 'B79', 'C65', nan, nan, nan, nan, nan, nan,
       'E25', nan, nan, 'D46', 'F33', nan, nan, nan, 'B73', nan, nan,
       'B18', nan, nan, nan, 'C95', nan, nan, nan, nan, nan, nan, nan,
       nan, 'B38', nan, nan, 'B39', 'B22', nan, nan, nan, 'C86', nan, nan,
       nan, nan, nan, 'C70', nan, nan, nan, nan, nan, 'A16', nan, 'E67',
       nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, 'C101',
       'E25', nan, nan, nan, nan, 'E44', nan, nan, nan, 'C68', nan, 'A10',
       nan, 'E68', nan, 'B41', nan, nan, nan, 'D20', nan, nan, nan, nan,
       nan, nan, nan, 'A20', nan, nan, nan, nan, nan, nan, nan, nan, nan,
       'C125', nan, nan, nan, nan, nan, nan, nan, nan, 'F4', nan, nan,
       'D19', nan, nan, nan, 'D50', nan, 'D9', nan, nan, 'A23', nan,
       'B50', nan, nan, nan, nan, nan, nan, nan, nan, 'B35', nan, nan,
       nan, 'D33', nan, 'A26', nan, nan, nan, nan, nan, nan, nan, nan,
       nan, nan, nan, 'D48', nan, nan, 'E58', nan, nan, nan, nan, nan,
       nan, 'C126', nan, 'B71', nan, nan, nan, nan, nan, nan, nan,
       'B51 B53 B55', nan, 'D49', nan, nan, nan, nan, nan, nan, nan, 'B5',
       'B20', nan, nan, nan, nan, nan, nan, nan, 'C68', 'F G63',
       'C62 C64', 'E24', nan, nan, nan, nan, nan, 'E24', nan, nan, 'C90',
       'C124', 'C126', nan, nan, 'F G73', 'C45', 'E101', nan, nan, nan,
       nan, nan, nan, 'E8', nan, nan, nan, nan, nan, 'B5', nan, nan, nan,
       nan, nan, nan, 'B101', nan, nan, 'D45', 'C46', 'B57 B59 B63 B66',
       nan, nan, 'B22', nan, nan, 'D30', nan, nan, 'E121', nan, nan, nan,
       nan, nan, nan, nan, 'B77', nan, nan, nan, 'B96 B98', nan, 'D11',
       nan, nan, nan, nan, nan, nan, 'E77', nan, nan, nan, 'F38', nan,
       nan, 'B3', nan, 'B20', 'D6', nan, nan, nan, nan, nan, nan,
       'B82 B84', nan, nan, nan, nan, nan, nan, 'D17', nan, nan, nan, nan,
       nan, 'B96 B98', nan, nan, nan, 'A36', nan, nan, 'E8', nan, nan,
       nan, nan, nan, 'B102', nan, nan, nan, nan, 'B69', nan, nan, 'E121',
       nan, nan, nan, nan, nan, 'B28', nan, nan, nan, nan, nan, 'E49',
       nan, nan, nan, 'C47', nan, nan, nan, nan, nan, nan, nan, nan, nan,
       'C92', nan, nan, nan, 'D28', nan, nan, nan, 'E17', nan, nan, nan,
       nan, 'D17', nan, nan, nan, nan, 'A24', nan, nan, nan, 'D35',
       'B51 B53 B55', nan, nan, nan, nan, nan, nan, 'C50', nan, nan, nan,
       nan, nan, nan, nan, 'B42', nan, 'C148', nan], dtype=object)

### handling the null value in the cabin by filling

In [96]:
df1["Has_Cabin"] = np.where(df1["Cabin"].notna(), "Yes", "No")

In [97]:
df1.head()

,Survived,Pclass,Sex,Age,Cabin,Family_size,Embarked_Q,Embarked_S,Embarked_C_1,fare_category,Has_Cabin
0,0,3,1,22.0,NaN,2,0,1,0,Low,No
1,1,1,0,38.0,C85,2,0,0,1,High,Yes
2,1,3,0,26.0,NaN,1,0,1,0,Low,No
3,1,1,0,35.0,C123,2,0,1,0,High,Yes
4,0,3,1,35.0,NaN,1,0,1,0,Low,No

## Now remove the cabin from dataframe

In [98]:
df1 = df1.drop(columns= ["Cabin"])

In [99]:
df1

,Survived,Pclass,Sex,Age,Family_size,Embarked_Q,Embarked_S,Embarked_C_1,fare_category,Has_Cabin
0,0,3,1,22.0,2,0,1,0,Low,No
1,1,1,0,38.0,2,0,0,1,High,Yes
2,1,3,0,26.0,1,0,1,0,Low,No
3,1,1,0,35.0,2,0,1,0,High,Yes
4,0,3,1,35.0,1,0,1,0,Low,No
...,...,...,...,...,...,...,...,...,...,...
886,0,2,1,27.0,1,0,1,0,Low,No
887,1,1,0,19.0,1,0,1,0,Medium,Yes
888,0,3,0,29.7,4,0,1,0,Medium,No
889,1,1,1,26.0,1,0,0,1,Medium,Yes
890,0,3,1,32.0,1,1,0,0,Low,No

In [100]:
df1["Has_Cabin"] = df1["Has_Cabin"].map({"Yes":1, "No":0})

In [101]:
df1.head()

,Survived,Pclass,Sex,Age,Family_size,Embarked_Q,Embarked_S,Embarked_C_1,fare_category,Has_Cabin
0,0,3,1,22.0,2,0,1,0,Low,0
1,1,1,0,38.0,2,0,0,1,High,1
2,1,3,0,26.0,1,0,1,0,Low,0
3,1,1,0,35.0,2,0,1,0,High,1
4,0,3,1,35.0,1,0,1,0,Low,0

In [102]:
cleaned_df = df1.copy()

In [103]:
cleaned_df

,Survived,Pclass,Sex,Age,Family_size,Embarked_Q,Embarked_S,Embarked_C_1,fare_category,Has_Cabin
0,0,3,1,22.0,2,0,1,0,Low,0
1,1,1,0,38.0,2,0,0,1,High,1
2,1,3,0,26.0,1,0,1,0,Low,0
3,1,1,0,35.0,2,0,1,0,High,1
4,0,3,1,35.0,1,0,1,0,Low,0
...,...,...,...,...,...,...,...,...,...,...
886,0,2,1,27.0,1,0,1,0,Low,0
887,1,1,0,19.0,1,0,1,0,Medium,1
888,0,3,0,29.7,4,0,1,0,Medium,0
889,1,1,1,26.0,1,0,0,1,Medium,1
890,0,3,1,32.0,1,1,0,0,Low,0

In [104]:
cleaned_df.to_csv("cleaned_titanic_dataset.csv")